Revit 2026 API

# CityLatitude Property

---

Latitude of the city

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Latitude { get; }
```
```vb
Public ReadOnly Property Latitude As Double
	Get
```
```cpp
public:
property double Latitude {
	double get ();
}
```
```fsharp
member Latitude : float with get
```

#### Property Value

Double

A read only property that contains the latitude of the city. The value returned is in radians, ranging from -PI to +PI.

#### Reference

City Class

Autodesk.Revit.DB Namespace